
nc: 2  # число классов

scales:
  c: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [48, 3, 2]]      # 0 — P1/2
  - [-1, 1, Conv,  [96, 3, 2]]      # 1 — P2/4
  - [-1, 2, C3k2,  [96,  False, 0.25]]
  - [-1, 1, Conv,  [192, 3, 2]]     # 3 — P3/8
  - [-1, 2, C3k2,  [192, False, 0.25]]
  - [-1, 1, Conv,  [384, 3, 2]]     # 5 — P4/16
  - [-1, 2, C3k2,  [384, True]]
  - [-1, 1, Conv,  [384, 3, 2]]     # 7 — P5/32
  - [-1, 1, C3k2,  [384, True]]
  - [-1, 1, SPPF,  [384, 5]]        # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C3k2, [192, False]]     # 12 — P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C3k2, [96, False]]      # 15 — P3 (для малых объектов)

  - [-1, 1, Conv, [96, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C3k2, [192, False]]     # 18 — P4

  - [-1, 1, Conv, [192, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C3k2, [384, True]]      # 21 — P5

  - [[15, 18, 21], 1, Detect, [nc]]
